app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "2jhtl"], ["body", "nwg5m0zzp98n3q7nrumr"], ["user_id", 2], ["created_at", "2020-09-06 09:56:52.863301"], ["updated_at", "2020-09-06 09:56:52.863301"]]
SELECT "books".* FROM "books"
---
  def create
    @new_book = Book.new(book_params)
    @new_book.user_id = current_user.id
  	if @new_book.save #入力されたデータをdbに保存する。
  		redirect_to @new_book, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all